# ServiceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..ServiceType Property
EnergyDataSettings Class See Also
---
The type of heating or cooling system.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public gbXMLServiceType ServiceType { get; set; }
```

Visual Basic
---
```text
Public Property ServiceType As gbXMLServiceType
	Get
	Set
```

Visual C++
---
```text
public:
property gbXMLServiceType ServiceType {
	gbXMLServiceType get ();
	void set (gbXMLServiceType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The service type does not fall within an appropriate range. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace